Public Attributes | List of all members
API_RGBAColor Struct Reference
View Handling
RGB color reference with transparency. More...
#include <APIdefs_Base.h>
 Public Attributes
 double  | f_red
red component
 double  | f_green
green component
 double  | f_blue
blue component
 double  | f_alpha
transparency
Detailed Description
RGB color reference with transparency.
Remarks
Each component expressed in [0.0... 1.0] interval. The {0.0, 0.0, 0.0} components represents the black, {1.0, 1.0, 1.0} the white color.